# Добавьте в модуль функцию, которая принимает на вход строку - текст загадки и число номера попытки с которой она отгадана
# Формировать словарь с информацией о результатах отгадывания
# Для хранения используйте защищенный словарь уровня модуля
#
# Отдельно напишите функцию, которая выводт результаты отгадывания защищенного словаря в удобном для чтения виде
# Для формирования результатов используйте генераторные выражения
#

from Task_06 import more, how_many_answers

more(3)

how_many_answers()